export interface StarData {
  star: string;
  period: string;
  contents: string;
}

const starData: StarData[] = [
  {
    star: "물병자리",
    period: "1/20~2/18",
    contents:
      "당신의 아이디어가 빛을 발하고 주변의 관심을 끌게 될 것입니다. 자신의 창의력을 믿고 새로운 도전에 나서보세요. 어려운 상황에서도 긍정적으로 생각하면 좋은 결과를 만들어낼 수 있을 겁니다.당신의 아이디어가 빛을 발하고 주변의 관심을 끌게 될 것입니다. 자신의 창의력을 믿고 새로운 도전에 나서보세요. 어려운 상황에서도 긍정적으로 생각하면 좋은 결과를 만들어낼 수 있을 겁니다.",
  },
  {
    star: "물고기자리",
    period: "2/19~3/20",
    contents:
      "이번 주는 내적으로 조화를 이루는 시간이 될 것입니다. 주변 사람들과의 관계에서 이해와 양해가 중요하니 자신의 감정을 솔직하게 표현해보세요. 마음의 안정을 위해 자기관리에 노력하는 것이 좋겠어요.",
  },
  {
    star: "양자리",
    period: "3/21~4/19",
    contents:
      "당신의 노력이 보람을 가져다줄 때입니다. 주변 사람들과 협력하여 목표를 이루는 데 성공할 것입니다. 자신을 믿고 당당하게 나아가면 좋은 결과를 만날 거에요.",
  },
  {
    star: "황소자리",
    period: "4/20~5/20",
    contents:
      "정적인 기반 위에서 미래를 준비하는 중요한 시기입니다. 자신의 재능을 발휘하여 주변을 밝게 만들어보세요. 지금의 노력이 미래에 큰 성취로 이어질 것입니다.",
  },
];

export default starData;
